Revit 2027 API
BuiltInFailures.FamilyFailures.StructuralColumnAttachedToNonStructuralTarget Property
 The structural column is attached to a non-structural target.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralColumnAttachedToNonStructuralTarget { get; }
Public Shared ReadOnly Property StructuralColumnAttachedToNonStructuralTarget As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralColumnAttachedToNonStructuralTarget {
	FailureDefinitionId^ get ();
}
static member StructuralColumnAttachedToNonStructuralTarget : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace